Revit 2026 API
VectorAtPoint Constructor
Overload List
Name | Description
VectorAtPoint(IList<XYZ>) | Initializes a new instance of the VectorAtPoint class
VectorAtPoint(VectorAtPoint) |  Creates a copy of the given VectorAtPoint instance.
Top
See Also
Reference
VectorAtPoint Class
Autodesk.Revit.DB.Analysis Namespace